fig = input("Въведете фигура-квадрат, правоъгълник, правоъгълен триъгълник:")
s = 0
p = 0
if fig == "квадрат":
    a = float(input("Въведете страна:"))
    s = a*a
    p = 4 * a
elif fig == "правоъгълник":
    a = float(input("Въведете страната a:"))
    b = float(input("Въведете страната b:"))
    s = a * b
    p = 2 * (a + b)
elif fig == "правоъгълен триъгълник":
    a = float(input("Въведете катета a:"))
    b = float(input("Въведете катета b:"))
    c = float(input("Въведете хипотенуза:"))
    s = a*b / 2
    p = a + b + c

if s == 0 and p==0:
    print("Невалидна фигура")
else:
    print(f"Обиколка: %.2f; Лице: %.2f" %(p, s))
    