# Принтираме числата от 1 до 10 през две–само нечетни
for n in range(1, 11, 2):
    print(n)

# Принтираме буквите от a до f включително
# ord('a') връща числената стойност на символа от ASCII таблицта
for l in range(ord('a') , ord('f')+1): 
    print(chr(l)) # взимаме буквената стойност на символа от ASCII таблицта

# Принтираме всяка буква от думата
w = "KSI"
for n in w:
    print(n)


# Принтираме числата от 1 до 10 през две–само нечетни с while цикъл
i = 1
while i <= 10:
    print(i)
    i+=2


# Принтираме сумата на всяка една цифра от число, въведено от потребителя
number = int(input("numer="))
sum = 0
while True:
    sum+= number % 10 # Взимаме остатъка от деленето на 10
    number = number // 10 # Взимаме целочислената стойност при деленето
    if not number:
        break
print(sum)

# Принтираме всички числа от 1 до 19 като прескачаме 5
for f in range(1,20):
    if number == 5:
        continue
    print(f)


# Принтираме числата от 15 до 3 през 2
for i in range(15, 2, -2):
    print(i)